reservester1.0/app/views/restaurants/index.html.erb

SELECT "restaurants".* FROM "restaurants"
---
    <% @categories.each do |category| %>
      <%= link_to "#{category.name} (#{category.restaurants.count})", category %>