reservester1.0/app/controllers/reservations_controller.rb

	def create
		# FIXME: reservation is always initialized with empty values, why is that?
		@reservation = Reservation.new(reservation_params)
		@reservation.restaurant = Restaurant.find(params[:reservation][:restaurant_id])
		if @reservation.save
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", "14"]]
INSERT INTO "reservations" ("created_at", "restaurant_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 06 Jun 2014 09:53:44 UTC +00:00], ["restaurant_id", 14], ["updated_at", Fri, 06 Jun 2014 09:53:44 UTC +00:00]]