reservester1.0/app/controllers/restaurants_controller.rb

  def show
    @restaurant = Restaurant.find params[:id]
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", "17"]]

  def new
    @restaurant = Restaurant.new
    @owner = Owner.find(params[:owner_id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = 1 ORDER BY "owners"."id" ASC LIMIT 1

  def create
    @restaurant = Restaurant.new restaurant_params
    @restaurant.owner_id = current_owner.id

    if @restaurant.save
---
INSERT INTO "restaurants" ("address", "created_at", "description", "name", "owner_id", "phone", "photo", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @restaurant = Restaurant.find params[:id]
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", "17"]]

  def update
    @restaurant = Restaurant.find params[:id]

    if @restaurant.update restaurant_params
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", "17"]]
UPDATE "restaurants" SET "name" = $1, "description" = $2, "phone" = $3, "address" = $4, "updated_at" = $5 WHERE "restaurants"."id" = 17  [["name", "BIg Sur"], ["description", "Coast line"], ["phone", "None"], ["address", "Off of Highway 1"], ["updated_at", Wed, 04 Jun 2014 13:18:44 UTC +00:00]]

  def destroy
    @restaurant = Restaurant.find params[:id]
    @restaurant.destroy
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", "18"]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 18]]